#language: ru

Функционал: Тестирование ссылок статусов
    Как администратор хочу протестировать все ссылки статусов

Сценарий: Тестирование ссылок заказы
    Допустим логинится пользователь с email "admin@admin.com" и паролем "qweasd"
    Если он жмёт на ссылку 'Все заказы' 
    То заказы в со статусом 'Все заказы' видно в таблице 

    Допустим администратор жмёт на ссылку 'Новые'
    То увидит в таблице заказы со статусом 'Новый'

    Если администратор жмёт на ссылку 'Выяснить'
    То увидит в таблице заказы со статусом 'Выяснить'

    Если администратор жмёт на ссылку 'Отсроченный'
    То увидит в таблице заказы со статусом 'Отсроченный'

    Если администратор жмёт на ссылку 'Подтверждённый'
    То увидит в таблице заказы со статусом 'Подтверждённый'

    Если администратор жмёт на ссылку 'Сборка заказа'
    То увидит в таблице заказы со статусом 'Сборка заказа'

    Если администратор жмёт на ссылку 'Подготовленный'
    То увидит в таблице заказы со статусом 'Подготовленный'

    Если администратор жмёт на ссылку 'Отправленный'
    То увидит в таблице заказы со статусом 'Отправленный'

    Если администратор жмёт на ссылку 'Врученный'
    То увидит в таблице заказы со статусом 'Врученный'

    Если администратор жмёт на ссылку 'Вручен и оплачен'
    То увидит в таблице заказы со статусом 'Вручен и оплачен'

    Если администратор жмёт на ссылку 'Возврат'
    То увидит в таблице заказы со статусом 'Возврат'

    Если администратор жмёт на ссылку 'Возврат получен'
    То увидит в таблице заказы со статусом 'Возврат получен'

    Если администратор жмёт на ссылку 'Доставлен'
    То увидит в таблице заказы со статусом 'Доставлен'

    Если администратор жмёт на ссылку 'Напоминание 1'
    То увидит в таблице заказы со статусом 'Напоминание 1'

    Если администратор жмёт на ссылку 'Напоминание 2'
    То увидит в таблице заказы со статусом 'Напоминание 2'

    Если администратор жмёт на ссылку 'Не подтверждён'
    То увидит в таблице заказы со статусом 'Не подтверждён'

    Если администратор жмёт на ссылку 'Отказ'
    То увидит в таблице заказы со статусом 'Отказ'

    Если администратор жмёт на ссылку 'Розыскивается'
    То увидит в таблице заказы со статусом 'Розыскивается'




    